___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna() # row NAN lar gider

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis = 1)# axis=1 column larda NAN lar gider

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.mean

<bound method DataFrame.mean of      A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3>

In [9]:
df.fillna(value = "sut")

     A    B  C
0    1    5  1
1    2  sut  2
2  sut  sut  3

In [10]:
df["A"].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [39]:
df.fillna(value = df["A"].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [40]:
df.fillna(df["C"].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

In [17]:
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,13,5,6,13,7,np.NaN,3,30])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}
)
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [18]:
df.isnull()

    Var1   Var2   Var3
0  False  False   True
1  False   True  False
2  False  False  False
3   True  False  False
4  False  False  False
5  False   True  False
6   True   True   True
7  False  False  False
8  False  False  False

In [19]:
df.notnull()

    Var1   Var2   Var3
0   True   True  False
1   True  False   True
2   True   True   True
3  False   True   True
4   True   True   True
5   True  False   True
6  False  False  False
7   True   True   True
8   True   True   True

In [20]:
df.isnull().sum()/len(df)*100

Var1    22.222222
Var2    33.333333
Var3    22.222222
dtype: float64

In [21]:
df.notnull().sum()

Var1    7
Var2    6
Var3    7
dtype: int64

In [22]:
df.notnull().sum().sum()

20

In [23]:
df.isnull().sum()

Var1    2
Var2    3
Var3    2
dtype: int64

In [24]:
df.isnull().sum().sum()

7

In [44]:
df.Var1.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: Var1, dtype: bool

In [47]:
df.Var1[df.Var1.isnull()]# conditional var1 de nan olanlari getir. 3 ve6

3   NaN
6   NaN
Name: Var1, dtype: float64

In [ ]:
def df():
    if df(x).isnull()== True
    return 
       False

In [ ]:
var1 bir tane bile NAN var ise True dondurur yoksa False dondurur.
var2 bir tane bile NAN var ise True dondurur yoksa False dondurur.
var3 bir tane bile NAN var ise True dondurur yoksa False dondurur.

In [51]:
any(df["Var1"])

True

In [52]:
df.isnull().any() ### sutunda bir tane bile NAN varsa True dondurur.

Var1    True
Var2    True
Var3    True
dtype: bool

In [53]:
df.isnull().any(axis = 1) ## row bazinda NAN varsa bir tane bile olsa True dondurur.

0     True
1     True
2    False
3     True
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [ ]:
### transform metodunu kullanmak lazim burda cok hata yapiliyor burada, ayni index olmali burasi onemli.

In [55]:
kosul = df.isnull().any(axis = 1)

In [56]:
df[kosul]

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
3   NaN   8.0   6.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN

In [ ]:
#fillna dedigimizde NAN a karsilik gelenler dolar bu kosul ile

In [57]:
df[~kosul] ### TERSI KOSUL un demek "~" isareti, yani dolu satirlari getir.

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [58]:
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [59]:
df[(df.Var1.notnull())& (df.Var2.notnull())& (df.Var3.notnull())]

   Var1  Var2  Var3
2   5.0   5.0   5.0
4   7.0  11.0  13.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [ ]:
koseli patantez icerisinde bool un bir seri yolladiginizda icinde TRUE olan degerler sergilenir.

In [62]:
df.dropna(how="all")

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [61]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8]

In [64]:
df.dropna(how="all", axis = 1)

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [66]:
df["delete_me"] = np.nan
df

   Var1  Var2  Var3  delete_me
0   2.0   8.0   NaN        NaN
1   3.0   NaN  13.0        NaN
2   5.0   5.0   5.0        NaN
3   NaN   8.0   6.0        NaN
4   7.0  11.0  13.0        NaN
5   1.0   NaN   7.0        NaN
6   NaN   NaN   NaN        NaN
7  10.0   2.0   3.0        NaN
8  14.0   3.0  30.0        NaN

In [68]:
df.dropna(axis=1, how = "all", inplace = True)
df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [ ]:
# Filling Value

In [69]:
df["Var1"].fillna(0)

0     2.0
1     3.0
2     5.0
3     0.0
4     7.0
5     1.0
6     0.0
7    10.0
8    14.0
Name: Var1, dtype: float64

In [70]:
df["Var1"].fillna(df["Var1"].mean())

0     2.0
1     3.0
2     5.0
3     6.0
4     7.0
5     1.0
6     6.0
7    10.0
8    14.0
Name: Var1, dtype: float64

In [ ]:
 #### sutunlari teker teker Var1 mean, Var2mean, Var3mean ile doldyrabilirim

In [71]:
df.apply(lambda x : x.fillna(x.mean()), axis = 0)  #### TUM SUTUNLARI MEAN ILE DOLDURDUK

   Var1       Var2  Var3
0   2.0   8.000000  11.0
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [72]:
df.mean()[:] ### Her sutunun mean ini hesapladi.

Var1     6.000000
Var2     6.166667
Var3    11.000000
dtype: float64

In [74]:
df.fillna(df.mean()[:])

   Var1       Var2  Var3
0   2.0   8.000000  11.0
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [75]:
df.mean()["Var1": "Var2"]

Var1    6.000000
Var2    6.166667
dtype: float64

In [78]:
df.fillna({"Var1" :6, "Var2":6.16"}) &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&

SyntaxError: EOL while scanning string literal (<ipython-input-78-1de1582d1dec>, line 1)

In [77]:
df.fillna(df.mean()["Var1":"Var2"])

   Var1       Var2  Var3
0   2.0   8.000000   NaN
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667   NaN
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [83]:
df.Var3.fillna(df["Var3"].median())  ### df["Var3"].fillna(df["Var3"].median())

0     7.0
1    13.0
2     5.0
3     6.0
4    13.0
5     7.0
6     7.0
7     3.0
8    30.0
Name: Var3, dtype: float64

In [79]:
pd.notna(df)

    Var1   Var2   Var3
0   True   True  False
1   True  False   True
2   True   True   True
3  False   True   True
4   True   True   True
5   True  False   True
6  False  False  False
7   True   True   True
8   True   True   True

In [80]:
df.where(pd.notna(df), df.mean(), axis = 1)

   Var1       Var2  Var3
0   2.0   8.000000  11.0
1   3.0   6.166667  13.0
2   5.0   5.000000   5.0
3   6.0   8.000000   6.0
4   7.0  11.000000  13.0
5   1.0   6.166667   7.0
6   6.0   6.166667  11.0
7  10.0   2.000000   3.0
8  14.0   3.000000  30.0

In [84]:
Var1 = np.array([1,3,6,np.NaN,7,1,9,np.NaN,15])
Var2 = np.array([7,np.NaN,5,8,12,np.NaN,np.NaN,2,3])
Var3 = np.array([np.NaN,12,5,6,14,7,np.NaN,2,31])
Var4 = np.array(["IT","IT","IT","HR","HR","HR","HR","IT","IT"])
df = pd.DataFrame(
        {"salary" : Var1,
         "Var2" : Var2,
         "Var3" : Var3,
         "department" : Var4}
)
df

   salary  Var2  Var3 department
0     1.0   7.0   NaN         IT
1     3.0   NaN  12.0         IT
2     6.0   5.0   5.0         IT
3     NaN   8.0   6.0         HR
4     7.0  12.0  14.0         HR
5     1.0   NaN   7.0         HR
6     9.0   NaN   NaN         HR
7     NaN   2.0   2.0         IT
8    15.0   3.0  31.0         IT

In [88]:
df.groupby("department")["salary"].mean()

department
HR    5.666667
IT    6.250000
Name: salary, dtype: float64

In [ ]:
#### EDA DA arabanin register fisrt register yila cevir 2020 den fisrt registeri cikar yeni bir sutun olustur,
### FUTURE e
km ve arabanin yili dogru orantili arabanin yilini yeni bir sutun olarak bul ve olustur.
km fillna yapacaksini ve bunu yasa gore yapin mantikli olan budur.

In [89]:
df.salary.fillna({0:1, 1:2, 2:3, 3:4, 4:5, 5:6, 6:7, 7:8, 8:9})

0     1.0
1     3.0
2     6.0
3     4.0
4     7.0
5     1.0
6     9.0
7     8.0
8    15.0
Name: salary, dtype: float64

In [96]:
df.salary.fillna(df.groupby("department")["salary"].transform("mean"))

0     1.000000
1     3.000000
2     6.000000
3     5.666667
4     7.000000
5     1.000000
6     9.000000
7     6.250000
8    15.000000
Name: salary, dtype: float64

In [93]:
df.groupby("department")["salary"].transform('mean') ### Bu groupby a gore bir seri olusturduk.

0    6.250000
1    6.250000
2    6.250000
3    5.666667
4    5.666667
5    5.666667
6    5.666667
7    6.250000
8    6.250000
Name: salary, dtype: float64

In [97]:
df["salary"].fillna(df.groupby("department")["salary"].transform('mean')) ### Bu iterable olan seriyi yolluyoruz.

0     1.000000
1     3.000000
2     6.000000
3     5.666667
4     7.000000
5     1.000000
6     9.000000
7     6.250000
8    15.000000
Name: salary, dtype: float64

## .fillna

In [ ]:
## en cok tekrar eden catagory ile doldurabiliriz

In [99]:
df("department").mode()

TypeError: 'DataFrame' object is not callable

In [98]:
df("department").fillna(df["department"].mode()[0])

TypeError: 'DataFrame' object is not callable

In [ ]:
####EDA da bazi kategoruk degisken deki bosluklari en cok tekrar eden oransal olarak doldurmak istiyorum % 40 aA % 20 B % 15 C % 15 D
####data frame in sutunu var her birini kendi oraninda doldurmak istersek method var ne kadar cok tekrar ediyorssa onunla dolduruyor.

In [100]:
df["department"].fillna(method = "bfill") # ffill ileriden basla dolduk bfill geriden basla doldur sirayla doldurur

0    IT
1    IT
2    IT
3    HR
4    HR
5    HR
6    HR
7    IT
8    IT
Name: department, dtype: object

In [101]:
df["department"].fillna(df["department"].mode()[0]

SyntaxError: unexpected EOF while parsing (<ipython-input-101-7a8ca0addd6b>, line 1)

In [102]:
df.department.fillna(df.department.mode()[0])

0    IT
1    IT
2    IT
3    HR
4    HR
5    HR
6    HR
7    IT
8    IT
Name: department, dtype: object

In [ ]:
#df.farazi.fillna(a, method = "ffill", limit = 200)
#df.farazi.fillna(b, method = "ffill", limit = 100)
#df.farazi.fillna(a, method = "ffill", limit = 100)
#df.farazi.fillna(c, method = "ffill", limit = 100)
#df.farazi.fillna(a, method = "ffill", limit = 100)
#df.farazi.fillna(b, method = "ffill", limit = 100)
#df.farazi.fillna(c, method = "ffill", limit = 200)
#df.farazi.fillna(a, method = "ffill", limit = 100)

In [ ]:
df.farazi.fillna(c, method = "ffill", limit = 100)

### Handling with Outliers

In [103]:
import numpy as np 
import numpy as np 
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter
import warnings
warnings.filterwarnings('ignore')

In [104]:
import seaborn as sns
df = sns.load_dataset('diamonds')
df = df.select_dtypes(include = ['float64', 'int64'])
df = df.dropna()
df.head()

   carat  depth  table  price     x     y     z
0   0.23   61.5   55.0    326  3.95  3.98  2.43
1   0.21   59.8   61.0    326  3.89  3.84  2.31
2   0.23   56.9   65.0    327  4.05  4.07  2.31
3   0.29   62.4   58.0    334  4.20  4.23  2.63
4   0.31   63.3   58.0    335  4.34  4.35  2.75

In [ ]:
sns.boxplot. #sns.barplot(x= "day", y = "tip", data=tips)

In [105]:
df_table = df["table"]

In [107]:
df_table.head()

0    55.0
1    61.0
2    65.0
3    58.0
4    58.0
Name: table, dtype: float64

In [108]:
pd.DataFrame(df_table).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 53940 entries, 0 to 53939
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   table   53940 non-null  float64
dtypes: float64(1)
memory usage: 842.8 KB

In [109]:
len(df_table)

53940

In [123]:
Q1 = df_table.quantile(0.25)
Q3 = df_table.quantile(0.75)
IQR = Q3-Q1

In [124]:
IQR

3.0

In [125]:
Q1

56.0

In [126]:
Q3

59.0

In [127]:
df.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [ ]:
#### TUKEY  teorisi

In [132]:
lower_lim = Q1 - 1.5 * IQR
upper_lim = Q3+1.5 *IQR

In [133]:
lower_lim

51.5

In [134]:
upper_lim

63.5

In [135]:
(df_table < lower_lim)

0        False
1        False
2        False
3        False
4        False
         ...
53935    False
53936    False
53937    False
53938    False
53939    False
Name: table, Length: 53940, dtype: bool

In [136]:
(df_table > upper_lim)

0        False
1        False
2         True
3        False
4        False
         ...
53935    False
53936    False
53937    False
53938    False
53939    False
Name: table, Length: 53940, dtype: bool

In [137]:
outliers_15_low = (df_table < lower_lim)

In [138]:
outliers_15_up = (df_table > upper_lim)

In [139]:
df_table [outliers_15_low]

1515     51.0
3238     50.1
3979     51.0
4150     51.0
5979     49.0
7418     50.0
8853     51.0
11368    43.0
22701    49.0
25179    50.0
26387    51.0
33586    51.0
35633    44.0
45798    51.0
46040    51.0
47630    51.0
Name: table, dtype: float64

In [140]:
len(df_table [outliers_15_low])

16

In [141]:
df_table [outliers_15_up]

2        65.0
91       69.0
145      64.0
219      64.0
227      67.0
         ...
53695    65.0
53697    65.0
53756    64.0
53757    64.0
53785    65.0
Name: table, Length: 589, dtype: float64

In [ ]:
Q1 = df[feature].quantile(0.05)
    Q3 = df[feature].quantile(0.95)
    IQR = Q3-Q1
    upper = Q3 + 1.5*IQR
    lower = Q1 - 1.5*IQR

In [ ]:
lower_lim =

In [ ]:
lower_lim

In [ ]:
outliers_25 df_table < lower_lim) | df_table > upper_lim)

In [ ]:
df_table[()]

In [ ]:
#### Vinsorize

In [ ]:
sns.boxplot.

In [ ]:
sns.distplot(df_table_win

In [142]:
df_table_win = pd.DataFrame(df_table_win)[0]

NameError: name 'df_table_win' is not defined

In [ ]:
df_table_win = winsorize()

In [ ]:
df_table.describe()

In [ ]:
df_table_win.describe()